"""
Напишите программу, которая получает на вход строку и выполняет с ней следующие действия:
- считает количество символов в ней
- приводит всю строку к нижнему регистру
- выводит оба ответа на экран
"""

s = input("Введите строку: ")
print("Количество символов в строке:", len(s), "\nСтрока в нижнем регистре:", s.lower())
